# Используем легковесный образ веб-сервера Nginx
FROM nginx:1.25-alpine

# Копируем наш кастомный конфигурационный файл для Nginx в контейнер
# Этот файл мы создадим на следующем шаге
COPY nginx.conf /etc/nginx/conf.d/default.conf

# Копируем все файлы нашего фронтенда (html, tsx, src) в папку,
# откуда Nginx будет раздавать статику
COPY . /usr/share/nginx/html

# Указываем Nginx, что нужно слушать порт 80 (стандартный для HTTP)
EXPOSE 80

# Команда, которая запускается при старте контейнера
CMD ["nginx", "-g", "daemon off;"]